---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ConicalSurface Properties
ConicalSurface Class See Also Send Feedback
---

The ConicalSurface type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Axis of the cone. This is the Z axis of the local coordinate system associated with this cone. |
|  | HalfAngle | Cone angle. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Surface.) |
|  | OrientationMatchesParametricOrientation | Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.  (Inherited from Surface.) |
|  | Origin | Apex of the cone. This is the origin of the local coordinate system associated with this cone. |
|  | XDir | X axis of the local coordinate system associated with this cone. |
|  | YDir | X axis of the local coordinate system associated with this cone. |

# See Also

ConicalSurface Class

Autodesk.Revit.DB Namespace